cf_billing/Documents/энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСети.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСети</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргТУМКДНаСтруктуреСети</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Строения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Строение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктураСети</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестСтруктураСетиТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСтруктураСетиТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтруктураСети</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСети/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= КонецДня(ДатаФактическогоСобытия);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= МоментВремени();
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
			
	МКДОткрыт 		= Истина;

	Если НЕ ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор тогда		
		Строение 		= ДополнительныеСвойства.ДанныеСтроения.Строение;
		МКДОткрыт 		= энргПроверкаДанныхАбонентаСервер.СостояниеМКД(Момент,Район,Строение,Организация);			
	КонецЕсли;
	
	Если не МКДОткрыт тогда
		Отказ= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " мкд закрыт");
	КонецЕсли;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
		
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеТочекУчета = ПолучитьДанныеТочекУчета();
	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,				Движения.бестСтруктураСетиТочекУчетаНП);	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеТочекУчета()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", 		Ссылка);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Регистратор", 		Ссылка);
	Запрос.УстановитьПараметр("Период", 			?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата));
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("ПериодРегистрации", 	Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.СтруктураСети КАК СтруктураСети,
	               |	&Регистратор КАК Регистратор,
	               |	&Организация КАК Организация,
	               |	&Район КАК Район,
	               |	&Период КАК Период,
	               |	&ПериодНачисления КАК ПериодНачисления,
	               |	&ПериодРегистрации КАК ПериодРегистрации,
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.ТочкаУчета КАК ТочкаУчета,
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.Строение КАК Строение
	               |ИЗ
	               |	Документ.энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСети.Строения КАК энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения
	               |ГДЕ
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.Ссылка = &Регистратор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.СтруктураСети,
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.ТочкаУчета,
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.Строение";

	Результат = Запрос.Выполнить();
	
	Возврат Результат; 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
